Repository: girisandeep/Django-PiGPIO
Catalog: PiGPIO/locale/*/LC_MESSAGES/django.po
Languages: de

source: Description
de: Beschreibung

source: Row
de: Reihe

source: Column
de: Spalte

source: Background color
de: Hintergrund Farbe

source: Text Color
de: Text Farbe

source: Programs
de: Programme

source: Buttons
de: Knöpfe

source: Remote
de: Fernbedienung

source: Docs
de: Doku

source: Pi GPIO Docs
de: Pi GPIO Doku

source: Using the API you can perform different actions related to your Raspberry Pi or PiGPIOs functions from any client. An automatically generated documentation can be found
de: Mithilfe der API können verschiedene Funktionen des Raspberry Pi und der PiGPIO Programme von beliebigen clients aus gesteuert werden. Eine automatisch generierte Dokumentation der API befindet sich

source: here
de: hier

source: See below for a brief overview of endpoints.
de: Unten befindet sich eine grobe Liste aller Endpunkte.

source: <b>NOTE:</b> The API is currently very limited in Features. If you would like to have functionality added consider implementing it yourself or request it trough a issue on <a href="https://github.com/vabene1111/Django-PiGPIO" target="_blank">GitHub</a>.
de: <b>WICHTIG:</b> Die API ist aktuell in ihrem Funktionsumfang noch stark begrenzt. Sollte zusätzliche Funktionalität gewünscht sein kann dise selbst implementiert werden oder durch einen Issue auf <a href="https://github.com/vabene1111/Django-PiGPIO" target="_blank">GitHub</a> gewünscht werden.

source: Function
de: Funktion

source: Run a program
de: Programm ausführen

source: Set GPIO Pin
de: Setze GPIO Pin

source: Edit program
de: Programm editieren

source: Get log and delete it
de: Log abholen und löschen

source: If the debug module is checked every GPIO function will automatically write debugging information to the log. This Block is best used for debugging a broken program and should be removed once debugging is finished to keep the log clean.
de: Wenn das Debug modul aktiviert ist werden von jeder GPIO Funktion automatisch debugging informationen in den Log geschrieben. Dieser Block wird am besten nur zum debuggen von kaputten Programmen genutzt und sollte danach entfernt werden um die Performance zu schonen und den Log übersichtlich zu halten.

source: <b>Warning:</b> On systems with limited performance (like older Raspberry Pi Models) heavy logging can cause significant performance loss. Once a program is working properly it is advised to minimise logging or remove it completely.
de: <b>Achtung:</b> Auf Systemen mit geringer Leistung (wie beispielsweise ältere Raspberry Pi Modelle) kann logging zu signifikanten performance Problemen führen. Sobald ein Programm richtig funktioniert sollte es minimiertoder komplett entfernt werden.

source: Type(s)
de: Typ(en)

source: Turns debug mode on and off
de: Schaltet den debug Modus an oder aus

source: Reads the GPIO Input of the given PIN. This Block does currently not support multiple pins like the output block.
de: Liest den Wert am angegebenen pin. Dieser Block unterstützt aktuell keine Pin Listen als eingabe (so wie beim GPIO output block.

source: Number
de: Zahl

source: Defines which pin to read
de: Gibt an welcher Pin gelesen wird

source: The Raspberry Pi as different modes to run in. The mode defines how the pins are numbered. If set to <b>Board</b> all pins are numbered with there corresponding physical location from 1 to 40. If set to <b>BCM</b> pins are identified by their Broadcom pin number. <a href="https://pinout.xyz/" target="_blank">This page</a> provides a nice overview of both numbering modes. If you are unsure its probably easiest to board mode as you can count the physical pins to get correct numbers.
de: Der Raspberry Pi verfügt über verschiedene Modi. Der Modus definiert wie die Pins nummeriert sind. Wenn er auf <b>Board</b> gesetzt ist werden alle Pins mit ihrer position auf der Platinevon 1 bis 40 nummeriert. Setzt man den Modus <b>BCM</b> werden die Pins anhand ihrer Broadcom pin number identifiziert. <a href="https://pinout.xyz/" target="_blank">Diese Seite</a> enthält eine praktische übersicht für beide Modi. Im Zweifel immer Board als Modus wählen da man so immer die Pins an der Platine zählen kann um die korrekten Pins zu erhalten.

source: Defines pin numbering mode
de: Setzt Modus für Pin nummerierung

source: List
de: Liste

source: Defines which pin(s) to set
de: Definiert welche(r) pin(s) gesetzt werden sollen

source: Defines pin state. Can either be 0 or 1.
de: Definiert pin Zustand. Kann entweder 0 oder 1 sein.

source: Any
de: Alles

source: Arguments are converted to strings and logged
de: Eingaben werden in text gewandelt und gespeichert

source: The Sleep Block pauses the program execution for the given amount of seconds
de: Der Sleep Block pausiert die Ausführung des Programs für die angegebene Anzahl Sekunden

source: Amount of seconds to sleep. To sleep partial seconds use this format
de: Anzahl Sekunden die das Programm stoppen soll. Bruchteile von sekunden können wie folgt angeben werden

source: Blockly Programming
de: Blockly Programmierung

source: Blockly is a visual programming language created by Google. It allows to easily create programs by dragging blocks together. The Block Program can than be converted into source code for different programming languages<br/> Pi GPIO uses blockly to allow you to create programs and than turn these programs into python code to run on a raspberry pi. <br/><br/>
de: Blockly ist eine visuelle Programmiersprache von Google. Es erlaubt das einfache erstellen durch das zusammenschieben von Blöcken. Das Block Program wird dannin Programmcode anderer Programmiersprachen umgewandelt.<br/> Pi GPIO benutzt Blockly um das einfache erstellen von Programmen zu ermöglichen die dan in Python Code umgewandelt und auf dem raspberry pi ausgeführt werden. <br/><br/>

source: Quickstart
de: Schnellstart

source: To get started open the programs page and create a new program. Click on the code button and start dragging blocks together.
de: Zum anfangen öffne die Programm seite und erstelle ein neues Programm. Nach dem erstellen klick auf den Code Knopf und bau dein erstes Programm zusammen.

source: Click <b>Save</b> to save your program to the database and generate the code needed to run it.
de: Klicke auf <b>Speichern</b> um zu Speichern und den Code zu generieren der notwendig ist damit das Programm laufen kann.

source: Click <b>Run</b> to run your program. A window will appear showing information about its status.
de: Klicke auf <b>Run</b> um das Programm auszuführen. Ein Fenster öffnet sich und zeigt Informationen über die Ausführung.

source: Click <b>Import/Export</b> to share your program or import programs from others.
de: Klicke auf <b>Import/Export</b> um Programme zu teilen oder Programme anderer zuimportieren.

source: Click <b>Program Info</b> to go back to the program page.
de: Klicke auf <b>Program Info</b> um das Program zu editieren.

source: Notes
de: Anmerkungen

source: Programs cannot be terminated. If you accidentally create and run an infinite loop its easiest to restart your raspberry pi.
de: Die Ausführung von Programmen kann aktuell nicht abgebrochen werden. Falls ein Programm versehentlich unendlich läuft istes am einfachsten den Raspberry Pi neu zu starten.

source: To learn more about programming with blockly visit
de: Um mehr über Blockly zu lernen besuche

source: You can define buttons that run a program of your choice directly from the Dashboard.<br/> Buttons can have different colors, icons and text. <br/> All buttons are placed on the home screen in three rows and columns. If you place more than one button in one cell they will hide each other. <br/>
de: Es ist möglich Knöpfe zu definieren die es ermöglichen Programme direkt vom Dashboard (Startseite) aus zu starten.<br/> Die Knöpfe können verschiedene Farben, Icons und Texte haben. <br/> Alle Knöpfe werden in Reihen und Spalten angeordnet. Wenn mehrere Buttons in der gleichen Reihe und Spalte sind überlagern sie sich gegenseitig. <br/>

source: Pi GPIO - Docs
de: Pi GPIO - Dokumentation

source: Blocks
de: Blöcke

source: Everything you always wanted to know about PiGPIOs custom Blocks.
de: Alles was es über die Blöcke zu wissen gibt.

source: Dashboard Buttons
de: Dashboard Knöpfe

source: The <i>Remote</i> Page allows to easily and quickly control the output state of each valid pin.<br/> The page is designed to work well on mobile devices to basically act like a tv remote for the raspberry pi.<br/> Pins that cant be used as outputs are automatically detected (as they are different on each model) and greyed out.
de: Die Seite <i>Fernbedienung</i> erlaubt es schnell und einfach den Ausgabe Zustand eines jeden Pins einzustellen.<br/> Die Seite ist darauf ausgelegt auf Mobilgeräten gut zu funktionieren und kann damit quasi wie eine Fernbedienung für den Raspberry Pi benutzt werden .<br/> Alle Pins die nicht zur Ausgabe verwendet werden können werden automatisch erkannt (da sie sich je nach Modell unterscheiden) und deaktiviert.

source: Open remote
de: Fernbedienung öffnen

source: Delete
de: Löschen

source: Are you sure you want to delete the %(title)s: <b>%(object)s</b>
de: Bist du sicher das du diesen %(title)s löschen willst: <b>%(object)s</b>

source: Cancel
de: Abbrechen

source: Edit
de: Bearbeiten

source: Save
de: Speichern

source: New
de: Neu

source: Program Details
de: Programm Details

source: Execution Info
de: Informationen

source: Copy
de: Kopieren

source: An Error occurred when trying to save your Program.
de: Beim Speichern des Programs ist ein Fehler aufgetreten.

source: There are unsaved changes to your Program. Do you want to run the last saved program ?
de: In deinem Programm sind noch Änderungen die nicht gespeichert wurden. Möchtest du die letzte gespeicherte Version ausführen ?

source: Something went terribly wrong:
de: Irgendwas ist komplett schief gelaufen:

source: Your username and password didn't match. Please try again.
de: Dein Nutzername und Passwort passen nicht zusammen. Bitte nochmal versuchen

source: Help
de: Hilfe

source: On
de: An

source: Off
de: Aus

source: Program finished successfully!
de: Programm erfolgreich durchgelaufen!

source: Trying to set status of undefined pin
de: Versuch undefinierten Pin zu setzen

source: There was an error trying to output on pin:
de: Es gab einen Fehler beim setzen von pin:

source: Trying to pass list to function not supporting lists:
de: Versuch eine Liste an eine Funktion zu übergeben die keine Listen unterstützt:

source: Changes saved!
de: Änderungen gespeichert!

source: Error saving changes!
de: Fehler beim speichern der Änderungen!

source: Program
de: Programm

source: Dashboard Button
de: Dashboard Knopf

source: New Program
de: Neues Programm

source: New Dashboard Button
de: Neuer Dashboard Knopf
